results/test1/zvol/d/fio-4k.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Mar 16 17:23:23 unknown last message repeated 1 timeS][eta 00m:44s]
Jobs: 4 (f=4): [F(4)][100.0%][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1096: Sat Mar 16 17:27:42 2024
  write: IOPS=294, BW=1179KiB/s (1207kB/s)(75.4MiB/65456msec); 0 zone resets
    slat (nsec): min=451, max=11715k, avg=51606.45, stdev=273378.04
    clat (nsec): min=581, max=6527.0M, avg=25798709.10, stdev=303681887.79
     lat (usec): min=23, max=6527.0k, avg=25850.32, stdev=303680.80
    clat percentiles (nsec):
     |  1.00th=[       964],  5.00th=[      6112], 10.00th=[     54528],
     | 20.00th=[    104960], 30.00th=[    181248], 40.00th=[    248832],
     | 50.00th=[    337920], 60.00th=[    473088], 70.00th=[    708608],
     | 80.00th=[   1105920], 90.00th=[   1990656], 95.00th=[   3293184],
     | 99.00th=[ 358612992], 99.50th=[1803550720], 99.90th=[6073352192],
     | 99.95th=[6140461056], 99.99th=[6543114240]
   bw (  KiB/s): min=   24, max=11160, per=100.00%, avg=5315.41, stdev=3465.40, samples=29
   iops        : min=    6, max= 2790, avg=1328.83, stdev=866.39, samples=29
  lat (nsec)   : 750=0.61%, 1000=0.48%
  lat (usec)   : 2=1.60%, 4=1.59%, 10=1.64%, 20=1.00%, 50=2.29%
  lat (usec)   : 100=10.00%, 250=20.86%, 500=21.49%, 750=9.96%, 1000=6.52%
  lat (msec)   : 2=12.10%, 4=6.02%, 10=1.77%, 20=0.64%, 50=0.43%
  lat (msec)   : 100=0.01%, 500=0.02%, 750=0.04%, 1000=0.08%, 2000=0.50%
  lat (msec)   : >=2000=0.37%
  cpu          : usr=0.33%, sys=4.75%, ctx=37004, majf=0, minf=0
  IO depths    : 1=0.9%, 2=5.7%, 4=52.6%, 8=40.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.8%, 8=4.2%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19291,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1097: Sat Mar 16 17:27:42 2024
  write: IOPS=314, BW=1257KiB/s (1288kB/s)(80.5MiB/65566msec); 0 zone resets
    slat (nsec): min=521, max=28351k, avg=40591.38, stdev=310621.17
    clat (nsec): min=571, max=6528.4M, avg=24179464.92, stdev=293877384.43
     lat (usec): min=20, max=6528.5k, avg=24220.06, stdev=293877.10
    clat percentiles (nsec):
     |  1.00th=[      1160],  5.00th=[     15296], 10.00th=[     59136],
     | 20.00th=[    115200], 30.00th=[    191488], 40.00th=[    264192],
     | 50.00th=[    358400], 60.00th=[    501760], 70.00th=[    733184],
     | 80.00th=[   1122304], 90.00th=[   1941504], 95.00th=[   3096576],
     | 99.00th=[  32636928], 99.50th=[1803550720], 99.90th=[6073352192],
     | 99.95th=[6140461056], 99.99th=[6543114240]
   bw (  KiB/s): min=   24, max=14027, per=100.00%, avg=5677.41, stdev=3636.18, samples=29
   iops        : min=    6, max= 3506, avg=1419.28, stdev=909.01, samples=29
  lat (nsec)   : 750=0.30%, 1000=0.43%
  lat (usec)   : 2=1.19%, 4=1.12%, 10=1.35%, 20=1.14%, 50=2.57%
  lat (usec)   : 100=9.72%, 250=20.57%, 500=21.47%, 750=10.73%, 1000=6.93%
  lat (msec)   : 2=13.04%, 4=5.76%, 10=1.88%, 20=0.51%, 50=0.33%
  lat (msec)   : 100=0.01%, 500=0.01%, 750=0.04%, 1000=0.08%, 2000=0.47%
  lat (msec)   : >=2000=0.35%
  cpu          : usr=0.36%, sys=5.38%, ctx=39434, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.5%, 4=50.7%, 8=44.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.5%, 8=3.5%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,20612,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1098: Sat Mar 16 17:27:42 2024
  write: IOPS=300, BW=1204KiB/s (1233kB/s)(77.1MiB/65566msec); 0 zone resets
    slat (nsec): min=501, max=32783k, avg=63840.68, stdev=441766.77
    clat (nsec): min=541, max=6526.9M, avg=25181068.75, stdev=301353280.87
     lat (usec): min=15, max=6526.9k, avg=25244.91, stdev=301365.56
    clat percentiles (nsec):
     |  1.00th=[       780],  5.00th=[      2928], 10.00th=[     39680],
     | 20.00th=[     98816], 30.00th=[    173056], 40.00th=[    248832],
     | 50.00th=[    342016], 60.00th=[    481280], 70.00th=[    700416],
     | 80.00th=[   1089536], 90.00th=[   1925120], 95.00th=[   2998272],
     | 99.00th=[  44302336], 99.50th=[1803550720], 99.90th=[6073352192],
     | 99.95th=[6140461056], 99.99th=[6543114240]
   bw (  KiB/s): min=   31, max=12720, per=100.00%, avg=5631.64, stdev=3793.66, samples=28
   iops        : min=    7, max= 3180, avg=1407.86, stdev=948.47, samples=28
  lat (nsec)   : 750=0.81%, 1000=0.99%
  lat (usec)   : 2=2.21%, 4=1.76%, 10=1.85%, 20=1.32%, 50=2.15%
  lat (usec)   : 100=9.20%, 250=19.76%, 500=21.01%, 750=10.60%, 1000=6.35%
  lat (msec)   : 2=12.55%, 4=5.94%, 10=1.69%, 20=0.49%, 50=0.32%
  lat (msec)   : 100=0.01%, 750=0.04%, 1000=0.08%, 2000=0.49%, >=2000=0.36%
  cpu          : usr=0.34%, sys=4.85%, ctx=38418, majf=0, minf=0
  IO depths    : 1=0.8%, 2=5.8%, 4=52.7%, 8=40.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.8%, 8=4.2%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19734,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1099: Sat Mar 16 17:27:42 2024
  write: IOPS=303, BW=1216KiB/s (1245kB/s)(77.8MiB/65566msec); 0 zone resets
    slat (nsec): min=491, max=39967k, avg=50206.13, stdev=520832.51
    clat (nsec): min=571, max=6526.3M, avg=24973182.12, stdev=300141297.67
     lat (usec): min=19, max=6527.1k, avg=25023.39, stdev=300156.65
    clat percentiles (nsec):
     |  1.00th=[       964],  5.00th=[      6176], 10.00th=[     49920],
     | 20.00th=[    101888], 30.00th=[    177152], 40.00th=[    244736],
     | 50.00th=[    333824], 60.00th=[    468992], 70.00th=[    675840],
     | 80.00th=[   1073152], 90.00th=[   1843200], 95.00th=[   3063808],
     | 99.00th=[  40108032], 99.50th=[1803550720], 99.90th=[6073352192],
     | 99.95th=[6207569920], 99.99th=[6543114240]
   bw (  KiB/s): min=   31, max=12448, per=100.00%, avg=5684.64, stdev=3942.39, samples=28
   iops        : min=    7, max= 3112, avg=1421.11, stdev=985.59, samples=28
  lat (nsec)   : 750=0.38%, 1000=0.69%
  lat (usec)   : 2=1.78%, 4=1.39%, 10=1.85%, 20=1.13%, 50=2.85%
  lat (usec)   : 100=9.55%, 250=21.10%, 500=21.10%, 750=10.70%, 1000=6.07%
  lat (msec)   : 2=12.46%, 4=5.28%, 10=1.77%, 20=0.51%, 50=0.41%
  lat (msec)   : 100=0.01%, 750=0.04%, 1000=0.08%, 2000=0.48%, >=2000=0.36%
  cpu          : usr=0.34%, sys=4.88%, ctx=38664, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.7%, 4=52.4%, 8=42.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.2%, 8=3.8%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,19929,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=4854KiB/s (4971kB/s), 1179KiB/s-1257KiB/s (1207kB/s-1288kB/s), io=311MiB (326MB), run=65456-65566msec