results/test1/zvol/d/fio-512.txt
random-write: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 4 (f=4): [w(4)][0.3%][eta 05h:38m:27s]
random-write: (groupid=0, jobs=1): err= 0: pid=1103: Sat Mar 16 17:45:33 2024
  write: IOPS=456, BW=228KiB/s (234kB/s)(14.1MiB/63294msec); 0 zone resets
    slat (nsec): min=241, max=13068k, avg=33336.43, stdev=169604.74
    clat (nsec): min=521, max=6797.4M, avg=17356857.37, stdev=250209733.92
     lat (usec): min=17, max=6797.4k, avg=17390.19, stdev=250209.50
    clat percentiles (nsec):
     |  1.00th=[      1160],  5.00th=[     15552], 10.00th=[     62720],
     | 20.00th=[    121344], 30.00th=[    191488], 40.00th=[    246784],
     | 50.00th=[    321536], 60.00th=[    423936], 70.00th=[    577536],
     | 80.00th=[    888832], 90.00th=[   1712128], 95.00th=[   3162112],
     | 99.00th=[  13303808], 99.50th=[1002438656], 99.90th=[5200936960],
     | 99.95th=[5804916736], 99.99th=[6811549696]
   bw (  KiB/s): min=    3, max= 1592, per=93.47%, avg=801.72, stdev=554.46, samples=36
   iops        : min=    6, max= 3185, avg=1603.50, stdev=1108.94, samples=36
  lat (nsec)   : 750=0.44%, 1000=0.35%
  lat (usec)   : 2=1.23%, 4=1.16%, 10=1.19%, 20=1.08%, 50=1.81%
  lat (usec)   : 100=9.57%, 250=23.56%, 500=25.10%, 750=10.89%, 1000=5.94%
  lat (msec)   : 2=9.33%, 4=4.61%, 10=2.58%, 20=0.30%, 50=0.14%
  lat (msec)   : 500=0.07%, 750=0.08%, 1000=0.06%, 2000=0.19%, >=2000=0.32%
  cpu          : usr=0.52%, sys=5.15%, ctx=56471, majf=0, minf=0
  IO depths    : 1=0.4%, 2=3.7%, 4=49.9%, 8=46.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.7%, 8=3.3%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,28879,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1104: Sat Mar 16 17:45:33 2024
  write: IOPS=410, BW=205KiB/s (210kB/s)(12.7MiB/63292msec); 0 zone resets
    slat (nsec): min=341, max=34313k, avg=44612.53, stdev=351404.05
    clat (nsec): min=561, max=6796.6M, avg=19288562.79, stdev=264445680.41
     lat (usec): min=20, max=6796.6k, avg=19333.18, stdev=264444.43
    clat percentiles (nsec):
     |  1.00th=[      1240],  5.00th=[      7648], 10.00th=[     56064],
     | 20.00th=[    122368], 30.00th=[    195584], 40.00th=[    254976],
     | 50.00th=[    333824], 60.00th=[    436224], 70.00th=[    602112],
     | 80.00th=[    913408], 90.00th=[   1794048], 95.00th=[   3358720],
     | 99.00th=[  20840448], 99.50th=[1132462080], 99.90th=[5200936960],
     | 99.95th=[6677331968], 99.99th=[6811549696]
   bw (  KiB/s): min=    2, max= 1869, per=81.68%, avg=700.95, stdev=560.44, samples=37
   iops        : min=    4, max= 3738, avg=1402.00, stdev=1120.96, samples=37
  lat (nsec)   : 750=0.24%, 1000=0.34%
  lat (usec)   : 2=1.61%, 4=1.50%, 10=1.89%, 20=1.46%, 50=1.94%
  lat (usec)   : 100=7.99%, 250=22.26%, 500=25.41%, 750=11.12%, 1000=6.06%
  lat (msec)   : 2=9.18%, 4=4.94%, 10=2.63%, 20=0.40%, 50=0.22%
  lat (msec)   : 100=0.01%, 500=0.06%, 750=0.12%, 1000=0.07%, 2000=0.21%
  lat (msec)   : >=2000=0.35%
  cpu          : usr=0.46%, sys=4.49%, ctx=52072, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.8%, 4=51.8%, 8=42.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.0%, 8=4.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,25952,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1105: Sat Mar 16 17:45:33 2024
  write: IOPS=414, BW=207KiB/s (212kB/s)(12.8MiB/63292msec); 0 zone resets
    slat (nsec): min=251, max=25676k, avg=39192.93, stdev=374547.92
    clat (nsec): min=621, max=6798.4M, avg=19114881.32, stdev=262638795.12
     lat (usec): min=21, max=6798.4k, avg=19154.07, stdev=262637.73
    clat percentiles (nsec):
     |  1.00th=[      1192],  5.00th=[     17024], 10.00th=[     63232],
     | 20.00th=[    124416], 30.00th=[    195584], 40.00th=[    257024],
     | 50.00th=[    337920], 60.00th=[    448512], 70.00th=[    618496],
     | 80.00th=[    962560], 90.00th=[   1843200], 95.00th=[   3457024],
     | 99.00th=[  21364736], 99.50th=[1132462080], 99.90th=[5200936960],
     | 99.95th=[5804916736], 99.99th=[6811549696]
   bw (  KiB/s): min=    3, max= 1608, per=84.83%, avg=727.36, stdev=515.00, samples=36
   iops        : min=    6, max= 3216, avg=1454.78, stdev=1029.96, samples=36
  lat (nsec)   : 750=0.28%, 1000=0.42%
  lat (usec)   : 2=1.42%, 4=1.16%, 10=1.19%, 20=0.74%, 50=2.00%
  lat (usec)   : 100=9.38%, 250=22.49%, 500=24.31%, 750=11.18%, 1000=6.17%
  lat (msec)   : 2=10.14%, 4=5.00%, 10=2.82%, 20=0.29%, 50=0.24%
  lat (msec)   : 500=0.07%, 750=0.10%, 1000=0.05%, 2000=0.22%, >=2000=0.35%
  cpu          : usr=0.47%, sys=4.53%, ctx=51001, majf=0, minf=0
  IO depths    : 1=0.5%, 2=4.4%, 4=50.3%, 8=44.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.3%, 8=3.7%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,26203,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1106: Sat Mar 16 17:45:33 2024
  write: IOPS=433, BW=217KiB/s (222kB/s)(13.4MiB/63294msec); 0 zone resets
    slat (nsec): min=241, max=15312k, avg=37706.47, stdev=241308.63
    clat (nsec): min=531, max=6798.4M, avg=18249546.88, stdev=259719194.55
     lat (usec): min=18, max=6798.4k, avg=18287.25, stdev=259718.53
    clat percentiles (nsec):
     |  1.00th=[      1020],  5.00th=[      6624], 10.00th=[     58112],
     | 20.00th=[    118272], 30.00th=[    193536], 40.00th=[    252928],
     | 50.00th=[    337920], 60.00th=[    444416], 70.00th=[    610304],
     | 80.00th=[    946176], 90.00th=[   1794048], 95.00th=[   3227648],
     | 99.00th=[  15138816], 99.50th=[1002438656], 99.90th=[5200936960],
     | 99.95th=[6677331968], 99.99th=[6811549696]
   bw (  KiB/s): min=    4, max= 1714, per=88.80%, avg=761.97, stdev=597.22, samples=36
   iops        : min=    8, max= 3429, avg=1524.00, stdev=1194.48, samples=36
  lat (nsec)   : 750=0.56%, 1000=0.38%
  lat (usec)   : 2=1.85%, 4=1.30%, 10=1.74%, 20=1.06%, 50=1.53%
  lat (usec)   : 100=8.93%, 250=22.07%, 500=24.41%, 750=11.25%, 1000=6.11%
  lat (msec)   : 2=9.98%, 4=5.03%, 10=2.59%, 20=0.30%, 50=0.13%
  lat (msec)   : 500=0.09%, 750=0.09%, 1000=0.08%, 2000=0.18%, >=2000=0.32%
  cpu          : usr=0.49%, sys=4.81%, ctx=55085, majf=0, minf=0
  IO depths    : 1=0.5%, 2=4.3%, 4=49.9%, 8=45.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.6%, 8=3.4%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,27449,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=857KiB/s (878kB/s), 205KiB/s-228KiB/s (210kB/s-234kB/s), io=53.0MiB (55.5MB), run=63292-63294msec